monkeyboard/Wiegand-to-HID-Keyboard-Converter-for-MonkeyBUS-PIC18/Firmware/Keyboard.c
    USBDeviceInit();	//usb_device.c.  Initializes USB module SFRs and firmware
    					//variables to known states.
}//end InitializeSystem



/******************************************************************************
 * Function:        void UserInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine should take care of all of the demo code
 *                  initialization that is required.
 *
 * Note:            
 *
 *****************************************************************************/
void UserInit(void)
{
	_sysTick = 0;
	_lastWiegand = 0;
	_cardTempHigh = 0;
	_cardTemp = 0;
	_bitCount = 0;

    mInitAllLEDs();
    mLED_2_On();
	mClrAnsel();		//Set input to digital
	mTwiPinInit();		//Initialise Wiegand pins
	mTwiPinConf();
	mClrInt0F();		//Clear INT0 interrupt flag
	mClrInt2F();		//Clear INT2 interrupt flag
	mTimer0Con();		//Set Timer0
	mClrTm0Init();
  	mReloadTm0();
    mEnInt();   

    //initialize the variable holding the handle for the last
    // transmission
    lastINTransmission = 0;
    lastOUTTransmission = 0;

}//end UserInit

/********************************************************************
 * Function:        void CheckAscii (char *ch)
 *
 * PreCondition:    None
 *
 * Input:           char pointer
 *
 * Output:          Modified input
 *
 * Side Effects:    None
 *
 * Overview:        Convert ascii to HID keyboard lookup code
 *
 * Note:            None
 *******************************************************************/
void CheckAscii (char *ch)
{
	if ((*ch > 96) && (*ch < 123))
	{
		*ch -= 87;
	}
	else if ((*ch > 48) && (*ch < 58))
	{
		*ch -= 48;
	}
	else if (*ch == '0')
	{
		*ch = 0;
	}
	else if (*ch == '\r')
	{
		*ch = 36;
		mLED_4_Off();
	}
	else if (*ch == ' ')
	{
		*ch = 37;
	}
	else if (*ch == '[')
	{
		*ch = 38;
	}
	else if (*ch == ']')
	{
		*ch = 39;
	}
	else if (*ch == 8)
	{
		*ch = 40;
	}
	
}//end CheckAscii

/********************************************************************
 * Function:        void SendChar (char *ch)
 *
 * PreCondition:    None
 *
 * Input:           char pointer
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Send character as keyboard output
 *
 * Note:            None
 *******************************************************************/
void SendChar (char *ch)
{
	CheckAscii (ch);
	Keyboard(ch);
} //end SendChar

/********************************************************************
 * Function:        unsigned long GetCardId (unsigned long *codehigh, unsigned long *code, char bitlength)
 *
 * PreCondition:    None
 *
 * Input:           Raw Wiegand code
 *
 * Output:          Card ID
 *
 * Side Effects:    None
 *
 * Overview:        Find card ID from Wiegand 26 or 34 data 
 *
 * Note:            None
 *******************************************************************/
unsigned long GetCardId (unsigned long *codehigh, unsigned long *code, char bitlength)
{
	unsigned long cardId=0;

	if (bitlength==26)								// EM tag
		cardId = (*code & 0x1FFFFFE) >>1;

	if (bitlength==34)								// Mifare 
	{
		*codehigh = *codehigh & 0x03;				// only need the 2 LSB of the codehigh
		*codehigh <<= 30;							// shift 2 LSB to MSB		
		*code >>=1;
		cardId = *codehigh | *code;
	}
	return cardId;
} //end GetCardId

/********************************************************************
 * Function:        unsigned long GetFc (unsigned long code)
 *
 * PreCondition:    None
 *
 * Input:           Raw Wiegand code
 *
 * Output:          Facility code
 *
 * Side Effects:    None
 *
 * Overview:        Find facility code from 26 bit Wiegand
 *
 * Note:            None
 *******************************************************************/
/*
unsigned long GetFc (unsigned long code)
{
	unsigned long fc;
	char i;

	fc = code & 0x3FFF000;
	fc = fc >> 17;
	if (fc % 2)
	{
		fc &= 0x1ff;
	}
	else
	{
		fc &= 0xff;
	}

	return fc;
}//end GetFc
*/

/********************************************************************
 * Function:        void DoWiegandCoversion (void)
 *	
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Converts Wiegand output into card number and
 *                  facility code.
 *
 * Note:            0x<Wiegand code> [facility code] <card ID>
 *******************************************************************/

void DoWiegandCoversion (void)
{
	char buff[MAXSIZE], i;
	char tempbitCount;
//	char hd [] = "0x";
//	char len = 2;
	unsigned long cardId;
	
	if ((_sysTick - _lastWiegand) > 25)		// if no more signal coming through after 25ms
	{
		if ((_bitCount==26) || (_bitCount==34) || (_bitCount==8)) 			// bitCount for keypress=8, Wiegand 26=26, Wiegand 34=34
		{
			_cardTemp >>= 1;		// shift right 1 bit to get back the real value - interrupt done 1 left shift in advance
			if (_bitCount>32)
				_cardTempHigh >>= 1;

			if((_bitCount==26) || (_bitCount==34))
			{
				cardId = GetCardId (&_cardTempHigh, &_cardTemp, _bitCount);
				//cardId=_cardTemp;
				tempbitCount=_bitCount;
				_bitCount=0;
				_cardTemp=0;
				_cardTempHigh=0;
/*				// If need to display with leading 0x for the hex data
				for (i = 0; i < len; i++)
				{
					SendChar (hd +i);
				}
*/
				memset (buff, 0, MAXSIZE);

				for (i = 0; i < 7;)
				{
					buff[i] =   (cardId & 0x0f);
					buff[i+1] = (cardId >> 4) & 0x0f;
					cardId >>= 8;
					i += 2;
				}
				
				if(tempbitCount==26)
				{
					for (i = 7; i > -1; i --)
					{	
    					Keyboard(buff + i);
					}
				}
				else
				{
					for (i=0; i<8; i+=2)
					{
						Keyboard(buff + i +1);
						Keyboard(buff + i);
					}
				
				}

				*buff = '\r';		// enter
				SendChar (buff);
			}
			else if (_bitCount==8)
			{
				// 8-bit Wiegand keyboard data, high nibble is the NOT of low nibble
				// eg if key 1 pressed, data=E1 in binary 11100001 , high nibble=1110 , low nibble = 0001 
				char highNibble = (_cardTemp & 0xf0) >>4;
				char lowNibble = (_cardTemp & 0x0f);
				_bitCount=0;
				_cardTemp=0;
				_cardTempHigh=0;
				
				if (lowNibble == (~highNibble & 0x0f))		// check if low nibble matches the NOT of high nibble.
				{
					if (lowNibble==0x0b)					
					{
						// Wiegand keypad ENT
						*buff = '\r';			// set as enter 
						SendChar(buff);
					}
					else if (lowNibble==0x0a)
					{
						// Wiegand keypad ESC
						*buff = 0x08;			// set as backspace
						SendChar(buff);
					}
					else				
						Keyboard(&lowNibble);		// else process Wiegand keypad 0-9 
				}
			}
		}
		else
		{
			// well time over 25 ms and bitCount !=8 , !=26, !=34 , must be noise then
			_lastWiegand=_sysTick;
			_bitCount=0;			
			_cardTemp=0;
			_cardTempHigh=0;
		}	
	}
}//end DoWiegandCoversion

